Revit 2026 API

# AnalyticalMemberIsValidCurve Method

---

Verifies if the curve is valid for an Analytical Member.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidCurve(
	Curve curve
)
```
```vb
Public Shared Function IsValidCurve (
	curve As Curve
) As Boolean
```
```cpp
public:
static bool IsValidCurve(
	Curve^ curve
)
```
```fsharp
static member IsValidCurve :
        curve : Curve -> bool
```

#### Parameters

curve Curve
     The curve to be verified.

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

AnalyticalMember Class

Autodesk.Revit.DB.Structure Namespace